package haima

var IidJukun = "2114"

var token = "bf4084a4ee65a3834fee70ec2bfdd3d1"

var success = "1"

var getMobileErr = map[string]string{
	"-1":  "暂时无号",
	"-2":  "Token不存在",
	"-3":  "项目ID不存在",
	"-4":  "上次获取失败,5秒后重试【如需取消强制延时,请联系客服添加白名单。前提是脚本严格控制好了延时】",
	"-5":  "项目未审核",
	"-6":  "项目已禁用",
	"-7":  "用户已禁用",
	"-8":  "余额不足,请充值",
	"-9":  "占号过多,请补充余额",
	"-10": "项目不允许指定取号",
}

var getCodeErr = map[string]string{
	"-1": "Token不存在",
	"-2": "pid不存在",
	"-3": "等待验证码",
	"-4": "已离线或强制释放",
	"-5": "上次获取失败,10秒后重试【如需取消强制延时,请联系客服添加白名单。前提是脚本严格控制好了延时】",
}
